OpenFOAM/libAcoustics-OF4.1/cases/FFWH+cfdbem_3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    free
    {
        type            patch;
        nFaces          1350;
        startFace       2560824;
    }
    sphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          264;
        startFace       2562174;
    }
)

// ************************************************************************* //
