OpenFOAM/libAcoustics-OF4.1/cases/FFWH+cfdbem_3D/system/fwhControl
sphereMonopole1AFassarat
{
        type		FfowcsWilliamsHawkings;
        #include	"fwhCommonSettings";
        patches ("sphere");
        interpolationScheme cell;
        
        surfaces
        (
                sphere
                {
                    type            patch;
                    patches         ("sphere");
                    interpolate     false;
                }
        );
        
        nonUniformSurfaceMotion false;
        Ufwh		(.0 .0 .0);
        
        cleanFreq 100;
        formulationType Farassat1AFormulation;
        fixedResponseDelay true;
        responseDelay   1e-3;
}

sphereStlCoarseMonopole1AFassarat
{
        type		FfowcsWilliamsHawkings;
        #include	"fwhCommonSettings";
        patches ("sphere");
        interpolationScheme cell;
        
        surfaces
        (
                sphere
                {
                    type            sampledTriSurfaceMesh;
                    surface         sphere_opt_357.stl;
                    source          cells;
                    interpolate     false;
                }
        );
        
        nonUniformSurfaceMotion false;
        Ufwh		(.0 .0 .0);
        
        cleanFreq 100;
        formulationType Farassat1AFormulation;
        fixedResponseDelay true;
        responseDelay   1e-3;
}

sphereStlMedMonopole1AFassarat
{
        type		FfowcsWilliamsHawkings;
        #include	"fwhCommonSettings";
        patches ("sphere");
        interpolationScheme cell;
        
        surfaces
        (
                sphere
                {
                    type            sampledTriSurfaceMesh;
                    surface         sphere_opt_1412.stl;
                    source          cells;
                    interpolate     false;
                }
        );
        
        nonUniformSurfaceMotion false;
        Ufwh		(.0 .0 .0);
        
        cleanFreq 100;
        formulationType Farassat1AFormulation;
        fixedResponseDelay true;
        responseDelay   1e-3;
}

sphereStlFineMonopole1AFassarat
{
        type		FfowcsWilliamsHawkings;
        #include	"fwhCommonSettings";
        patches ("sphere");
        interpolationScheme cell;
        
        surfaces
        (
                sphere
                {
                    type            sampledTriSurfaceMesh;
                    surface         sphere_opt_5677.stl;
                    source          cells;
                    interpolate     false;
                }
        );
        
        nonUniformSurfaceMotion false;
        Ufwh		(.0 .0 .0);
        
        cleanFreq 100;
        formulationType Farassat1AFormulation;
        fixedResponseDelay true;
        responseDelay   1e-3;
}
